package bars;

/* Зміна регістру. Написати функцію, яка приймає як аргумент символ латинського алфавіту 
 * та повертає той самий символ, але в протилежному регістрі. Вважається що значення 
 * аргументу, переданого до функції, гарантовано коректне. Стандартні функції та умовні 
 * операції не використовувати, скористатися побітовими операціями. Максимально уникати 
 * зайвих перетворень типів. Перевірити роботу написаної функції в основній програмі на 
 * деякій кількості випадково обраних символів.
 */

public class ChangeRegister {

	public static void main(String[] args) {

		char ch = 'L';
		
		System.out.println (ch);
		System.out.println (change (ch));

	}

	public static char change (char var){
		
		var = (char) (var^32);
		return var;
	}
	
}
